Repository: CofficLab/Lumi
Catalog: Packages/XcodeKit/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Syntax Only
zh_hans: 仅语法
zh_hk: 僅語法

source: Single-File Inference
zh_hans: 单文件推断
zh_hk: 單檔推斷

source: Partial Index
zh_hans: 部分索引
zh_hk: 部分索引

source: Full Index
zh_hans: 完整索引
zh_hk: 完整索引

source: LSP server not started, unable to process request
zh_hans: LSP 服务器未启动，无法处理请求
zh_hk: LSP 伺服器未啟動，無法處理請求

source: LSP server connection lost, attempting to reconnect...
zh_hans: LSP 服务器连接断开，正在尝试重新连接...
zh_hk: LSP 伺服器連線中斷，正在嘗試重新連線...

source: Current file is not bound to a valid Xcode project context
zh_hans: 当前文件未绑定到有效的 Xcode 项目上下文
zh_hk: 目前檔案未繫結到有效的 Xcode 專案上下文

source: Build context unavailable: %@
zh_hans: 构建上下文不可用：%@
zh_hk: 建置上下文不可用：%@

source: Unable to resolve symbol%@
zh_hans: 无法解析符号%@
zh_hk: 無法解析符號%@

source: No matching symbol found
zh_hans: 未找到匹配的符号
zh_hk: 未找到匹配的符號

source: Project is being indexed, semantic navigation may be incomplete
zh_hans: 项目正在索引，语义导航可能不完整
zh_hk: 專案正在索引，語意導覽可能不完整

source: '%@' does not belong to any compilation target, please check if the file is in the project
zh_hans: '%@' 不属于任何编译目标，请检查该文件是否在项目中
zh_hk: '%@' 不屬於任何編譯目標，請檢查該檔案是否在專案中

source: '%1$@' belongs to multiple targets (%2$@), current scheme '%3$@' cannot uniquely determine semantic context
zh_hans: '%1$@' 属于多个目标（%2$@），当前 scheme '%3$@' 无法唯一确定语义上下文
zh_hk: '%1$@' 屬於多個目標（%2$@），目前 scheme '%3$@' 無法唯一確定語意上下文

source: '%1$@' belongs to multiple targets (%2$@), cannot uniquely determine semantic context
zh_hans: '%1$@' 属于多个目标（%2$@），无法唯一确定语义上下文
zh_hk: '%1$@' 屬於多個目標（%2$@），無法唯一確定語意上下文

source: '%1$@' belongs to target (%2$@), but current scheme '%3$@' does not include these targets
zh_hans: '%1$@' 属于目标（%2$@），但当前 scheme '%3$@' 不包含这些目标
zh_hk: '%1$@' 屬於目標（%2$@），但目前 scheme '%3$@' 不包含這些目標

source: '%@' belongs to target (%@), but current active scheme does not include these targets
zh_hans: '%@' 属于目标（%@），但当前活动 scheme 不包含这些目标
zh_hk: '%@' 屬於目標（%@），但目前活動 scheme 不包含這些目標

source: LSP request timed out, please try again later
zh_hans: LSP 请求超时，请稍后重试
zh_hk: LSP 請求逾時，請稍後重試

source: Try reopening the file or restarting Lumi
zh_hans: 尝试重新打开文件或重启 Lumi
zh_hk: 嘗試重新開啟檔案或重啟 Lumi

source: Wait for auto-reconnect, or manually switch files to trigger rebuild
zh_hans: 等待自动重连，或手动切换文件以触发重新构建
zh_hk: 等待自動重連，或手動切換檔案以觸發重新建置

source: Ensure .xcodeproj/.xcworkspace is in the project root directory
zh_hans: 确保 .xcodeproj/.xcworkspace 位于项目根目录
zh_hk: 確保 .xcodeproj/.xcworkspace 位於專案根目錄

source: Run brew install xcode-build-server and reopen the project
zh_hans: 运行 brew install xcode-build-server 并重新打开项目
zh_hk: 執行 brew install xcode-build-server 並重新開啟專案

source: Wait for indexing to complete and retry, or check sourcekit-lsp logs
zh_hans: 等待索引完成后重试，或查看 sourcekit-lsp 日志
zh_hk: 等待索引完成後重試，或檢視 sourcekit-lsp 日誌

source: Wait for indexing to complete and try again
zh_hans: 等待索引完成后再试
zh_hk: 等待索引完成後再試

source: Add the file to a target
zh_hans: 将文件添加到某个目标
zh_hk: 將檔案加入某個目標

source: Switch to a more specific scheme, or keep only one target membership and retry
zh_hans: 切换到更具体的 scheme，或只保留一个 target 成员后重试
zh_hk: 切換到更具體的 scheme，或只保留一個 target 成員後重試

source: Switch to a scheme that includes the file's target and retry
zh_hans: 切换到包含该文件目标 的 scheme 后重试
zh_hk: 切換到包含該檔案目標的 scheme 後重試

source: Try again
zh_hans: 重试
zh_hk: 重試
